AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТабличнойЧасти</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТабличнойЧасти</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Резервирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Резервирование</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.ЗаказДоговор</xr:Item>
				<xr:Item>Document.Монтаж</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезервеНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыРезервирований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТабличнойЧасти</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТабличнойЧасти</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах/Ext/RecordSetModule.bsl
Функция ПолучитьЦенуОстаткаНоменклатуры(Знач ДатаОстатков, Знач Организация, Знач Склад, Знач Номенклатура, Знач ХарактеристикаНоменклатуры, Знач СерияНоменклатуры) Экспорт
	
	ОбщиеСклады = Константы.ОбщиеСклады.Получить();
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ТоварыНаСкладахОстатки.СуммаОстаток) КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			&ДатаОстатков,
	|				Склад = &Склад"
	+ ?(ОбщиеСклады, "", "
	|	И	Организация = &Организация") + "
	//|	И	Организация = &Организация
	|				И Номенклатура = &Номенклатура
	|				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	|				И СерияНоменклатуры = &СерияНоменклатуры) КАК ТоварыНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОстатки.Номенклатура";
	
	Запрос.УстановитьПараметр("ДатаОстатков",ДатаОстатков);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Склад",Склад);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("СерияНоменклатуры",СерияНоменклатуры);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.КоличествоОстаток = 0 Тогда
			Результат = Выборка.СуммаОстаток / Выборка.КоличествоОстаток; 
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//#8288
Функция ПолучитьЦеныОстаткаНоменклатуры(Знач ДатаОстатков, Знач Организация, Знач Склад, Знач Номенклатура, Знач ХарактеристикаНоменклатуры, Знач СерияНоменклатуры) Экспорт
		
	Цена = 0;
	ЦенаВал = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ТоварыНаСкладахОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	СУММА(ТоварыНаСкладахОстатки.СуммаВалОстаток) КАК СуммаВалОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			&ДатаОстатков,
	|			ВЫБОР
	|					КОГДА &ОбщиеСклады
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Организация = &Организация
	|				КОНЕЦ
	|				И Склад = &Склад
	|				И Номенклатура = &Номенклатура
	|				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	|				И СерияНоменклатуры = &СерияНоменклатуры) КАК ТоварыНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОстатки.Номенклатура";
	
	Запрос.УстановитьПараметр("ДатаОстатков",	ДатаОстатков);
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Склад",			Склад);
	Запрос.УстановитьПараметр("ОбщиеСклады",	Константы.ОбщиеСклады.Получить());
	Запрос.УстановитьПараметр("Номенклатура",	Номенклатура);	
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("СерияНоменклатуры",СерияНоменклатуры);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.КоличествоОстаток = 0 Тогда
			Цена = Выборка.СуммаОстаток / Выборка.КоличествоОстаток; 
			ЦенаВал = Выборка.СуммаВалОстаток / Выборка.КоличествоОстаток;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("Цена, ЦенаВал", Цена, ЦенаВал);
	
КонецФункции

//контроль остатков по регистру
//параметры:
//Документ - ДокументСсылка - ссылка на документ-регистратор
//СкладРасхода - Справочник.Склады - склад,на котором проверяется остаток
//ТаблицаТовары - ТаблицаЗначений - товары, которые нужно списывать. Колонки:
//										- Номенклатура - Справочник.Номенклатура
//										- Количество - число
//ДатаДвижения - Дата на которую осуществляется движение - если не задана, будет использована дата документа
//
//Возвращает:
//истина 	- контроль остатков пройден, товар списан
//ложь 		- контроль остатков не пройден либо вызвана ошибка
Функция КонтрольОстатков(Знач Документ, Знач Организация, Знач СкладРасхода, Знач ТаблицаТовары, Знач ДатаДвижения = Неопределено, ЭтоРезервирование = Ложь, ВыводОшибкиВРМК = Ложь, ИнформацияОбОшибке = Неопределено) Экспорт
	
	Результат = Истина;
	
	Если Константы.НеКонтролироватьОстаткиНаСкладах.Получить() Тогда
		Возврат Результат;
	КонецЕсли;
	
	// №3626
	Если ЭтоРезервирование И Константы.РазрешитьРезервированиеОтсутствующегоТовара.Получить() Тогда
		Возврат Результат;
	КонецЕсли;
	
	//ОбщиеСклады = Константы.ОбщиеСклады.Получить();
	
	Если (ДатаДвижения = Неопределено) или (ДатаДвижения = Дата(1,1,1)) Тогда
		ДатаДвижения = Документ.Дата;
	КонецЕсли;
	
	ВремТаблицаТовары = Новый ТаблицаЗначений;
	ВремТаблицаТовары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ВремТаблицаТовары.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ВремТаблицаТовары.Колонки.Добавить("СерияНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	ВремТаблицаТовары.Колонки.Добавить("Количество",Новый ОписаниеТипов("число"));
	ВремТаблицаТовары.Колонки.Добавить("Коэффициент",Новый ОписаниеТипов("число"));
	
	//++ №6629 добавился вид документа резерва "Монтаж"
	//ВремТаблицаТовары.Колонки.Добавить("Заказ", Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя")); // №3626
	МассивВидов = новый Массив;
	МассивВидов.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
	МассивВидов.Добавить(Тип("ДокументСсылка.Монтаж"));
	ВремТаблицаТовары.Колонки.Добавить("Заказ", новый ОписаниеТипов(МассивВидов));
	//-- №6629
	
	Для Каждого ТекущаяСтрока Из ТаблицаТовары Цикл
		//++ #12079
		//Если НЕ ТекущаяСтрока.Номенклатура = Справочники.Номенклатура.ОстаткиПленки
		//	И НЕ ТекущаяСтрока.Номенклатура = Справочники.Номенклатура.МатериалЗаказчика Тогда
		Если НЕ ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.ОстатокПленки
			//++ #14311
			//И НЕ ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.МатериалЗаказчика Тогда
			И НЕ ТекущаяСтрока.Номенклатура.МатериалЗаказчика Тогда
			Если НЕ Константы.НеКонтролироватьОстаткиМатериаловНаСкладах.Получить() ИЛИ 
				(Константы.НеКонтролироватьОстаткиМатериаловНаСкладах.Получить() И 
				НЕ ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно) Тогда
			//-- #14311
		//-- #12079
					НоваяСтрока = ВремТаблицаТовары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
				КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
	ВремТаблицаТовары.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,СерияНоменклатуры,Коэффициент, Заказ", "Количество");
	
	Запрос = Новый Запрос; 	
	Запрос.УстановитьПараметр("ИспользоватьРезервирование", Константы.ИспользоватьРезервирование.Получить());
	//Запрос.УстановитьПараметр("ТекДата",ДатаДвижения);
	Запрос.УстановитьПараметр("ТекДатаГраница", Новый Граница(ДатаДвижения, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Склад",СкладРасхода);
	Запрос.УстановитьПараметр("ТаблицаТовары",ВремТаблицаТовары); 
	//nva +++
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда       
		Если ТипЗнч(Документ.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			//СписокПодчиненныеДокументы = ОбщийМодульДокументы.ПолучитьПодчиненныеДокументы(Документ.Основание);
			Запрос.УстановитьПараметр("ДокументРезерва", Документ.Основание);  //nva 
		Иначе
			Запрос.УстановитьПараметр("ДокументРезерва", Документы.Резервирование.ПустаяСсылка());
		КонецЕсли;
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.Резервирование") Тогда       
		Если ТипЗнч(Документ.ДокументРезерва) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			//СписокПодчиненныеДокументы = ОбщийМодульДокументы.ПолучитьПодчиненныеДокументы(Документ.Основание);
			Запрос.УстановитьПараметр("ДокументРезерва", Документ.ДокументРезерва);  //nva 
		Иначе
			Запрос.УстановитьПараметр("ДокументРезерва", Документы.Резервирование.ПустаяСсылка());
		КонецЕсли;	
	Иначе                                 
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Документ, "Основание") И ТипЗнч(Документ.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			Запрос.УстановитьПараметр("ДокументРезерва", Документ.Основание);	
		ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Документ, "Основание") И ТипЗнч(Документ.Основание) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
			Запрос.УстановитьПараметр("ДокументРезерва",Документ.Основание.ДокументОснование);
		Иначе	
			Запрос.УстановитьПараметр("ДокументРезерва", Документы.ЗаказПокупателя.ПустаяСсылка());
		КонецЕсли;	
	КонецЕсли;
	//nva ---
	
	ВременныеТаблицы = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = ВременныеТаблицы;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ТаблицаТовары.Количество КАК Количество,
	|	ТаблицаТовары.Коэффициент КАК Коэффициент,
	|	ТаблицаТовары.Заказ КАК Заказ
	|ПОМЕСТИТЬ ВТ_ТаблицаТовары
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ВЫРАЗИТЬ(СУММА(ЕСТЬNULL(ВТ_ТаблицаТовары.Количество * ВТ_ТаблицаТовары.Коэффициент, 0)) КАК ЧИСЛО(15, 2)) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВРезервеОстатки.КоличествоОстаток, 0) > (ЕСТЬNULL(ВТ_ТаблицаТовары.Количество * ВТ_ТаблицаТовары.Коэффициент, 0))
	|				ТОГДА ЕСТЬNULL(ВТ_ТаблицаТовары.Количество * ВТ_ТаблицаТовары.Коэффициент, 0)
	|				ИНАЧЕ ЕСТЬNULL(ВРезервеОстатки.КоличествоОстаток, 0)
	|			КОНЕЦ
	|	) КАК ВРезервеПодДаннуюСтроку
	|ПОМЕСТИТЬ ТаблицаТовары
	|ИЗ
	|	ВТ_ТаблицаТовары КАК ВТ_ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Организация = &Организация) КАК ВРезервеОстатки
	|		ПО (ВТ_ТаблицаТовары.Номенклатура = ВРезервеОстатки.Номенклатура)
	|			И (ВТ_ТаблицаТовары.ХарактеристикаНоменклатуры = ВРезервеОстатки.ХарактеристикаНоменклатуры)
	|			И (ВТ_ТаблицаТовары.СерияНоменклатуры = ВРезервеОстатки.СерияНоменклатуры)
	//|			И (ВЫБОР
	//|			КОГДА ВТ_ТаблицаТовары.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка)
	//|					ИЛИ ВТ_ТаблицаТовары.Заказ ЕСТЬ NULL
	//|				ТОГДА 
	|           И ВРезервеОстатки.ДокументРезерва = &ДокументРезерва
	//|			ИНАЧЕ 
	//|           И (ВТ_ТаблицаТовары.Заказ = ВРезервеОстатки.ДокументРезерва)
	//|		КОНЕЦ)
	|			И (ВРезервеОстатки.Склад = &Склад)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаТовары.Номенклатура,
	|	ВТ_ТаблицаТовары.ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаТовары.СерияНоменклатуры
	|;	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокСписания.Номенклатура КАК Номенклатура,
	|	ДокСписания.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДокСписания.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ДокСписания.Количество КАК Количество,
	|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ВЫБОР		
	|		КОГДА &ИспользоватьРезервирование
	|			ТОГДА ЕСТЬNULL(ВРезервеОстатки.КоличествоОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоВРезерве,
	|	ВЫБОР		
	|		КОГДА &ИспользоватьРезервирование
	|			ТОГДА ЕСТЬNULL(ДокСписания.ВРезервеПодДаннуюСтроку, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоВРезервеПодДаннуюСтроку
	|
	|ИЗ
	|	ТаблицаТовары КАК ДокСписания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&ТекДатаГраница,
	|				Склад = &Склад
	|					И Организация = &Организация
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							ДокСписания.Номенклатура
	|						ИЗ
	|							ТаблицаТовары КАК ДокСписания)
	|					И ХарактеристикаНоменклатуры В
	|						(ВЫБРАТЬ
	|							ДокСписания.ХарактеристикаНоменклатуры
	|						ИЗ
	|							ТаблицаТовары КАК ДокСписания)
	|					И СерияНоменклатуры В
	|						(ВЫБРАТЬ
	|							ДокСписания.СерияНоменклатуры
	|						ИЗ
	|							ТаблицаТовары КАК ДокСписания)) КАК Остатки
	|		ПО (Остатки.Номенклатура = ДокСписания.Номенклатура)
	|			И (Остатки.ХарактеристикаНоменклатуры = ДокСписания.ХарактеристикаНоменклатуры)
	|			И (Остатки.СерияНоменклатуры = ДокСписания.СерияНоменклатуры)
	// №12407 остатки по резервам смотрим на дату движения|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Организация = &Организация) КАК ВРезервеОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&ТекДатаГраница, Организация = &Организация) КАК ВРезервеОстатки
	|		ПО (ДокСписания.Номенклатура = ВРезервеОстатки.Номенклатура)
	|			И (ДокСписания.ХарактеристикаНоменклатуры = ВРезервеОстатки.ХарактеристикаНоменклатуры)
	|			И (ДокСписания.СерияНоменклатуры = ВРезервеОстатки.СерияНоменклатуры)
	|			И (ВРезервеОстатки.Склад = &Склад)";	
	
	ВыборкаСписание = Запрос.Выполнить().Выбрать();
	Пока ВыборкаСписание.Следующий() Цикл		
		ОбщееКоличествоВРезерве = Мин(ВыборкаСписание.КоличествоОстаток, ВыборкаСписание.КоличествоВРезерве); //#15038 если был перерезерв
		Если (ВыборкаСписание.КоличествоОстаток - ОбщееКоличествоВРезерве + ВыборкаСписание.КоличествоВРезервеПодДаннуюСтроку) < ВыборкаСписание.Количество Тогда
			ОстатокВРезерве = ОбщееКоличествоВРезерве - ВыборкаСписание.КоличествоВРезервеПодДаннуюСтроку;
			ОписаниеОшибки = СтрШаблон("%1 %2 %3 %4"
				, ?(ЭтоРезервирование, "Резервируется", "Списывается")
				, Строка(ВыборкаСписание.Номенклатура) + ?(ВыборкаСписание.ХарактеристикаНоменклатуры.Пустая(), "", ", Характеристика: " + Строка(ВыборкаСписание.ХарактеристикаНоменклатуры)) + ?(ВыборкаСписание.СерияНоменклатуры.Пустая(), "", ", Серия: " + Строка(ВыборкаСписание.СерияНоменклатуры))
				, "в количестве = " + ВыборкаСписание.Количество + ", остаток на складе = " + ВыборкаСписание.КоличествоОстаток
				//++ №13391
				//, ?((ОстатокВРезерве) > 0, ", доступно = " + (Строка(ВыборкаСписание.КоличествоОстаток) - Строка(ОстатокВРезерве)) + ", из них в резерве = " + (Строка(ОстатокВРезерве)), "")
				, ?(ОстатокВРезерве > 0, ", в резерве под другие заказы = " + ОстатокВРезерве + ", доступно для текущего документа = " + (ВыборкаСписание.КоличествоОстаток - ОстатокВРезерве), "")
				//-- №13391
			);
			Если ВыводОшибкиВРМК Тогда
				ИнформацияОбОшибке = ИнформацияОбОшибке + ?(НЕ Результат, Символы.ПС, "") + ОписаниеОшибки;
			Иначе	
				Сообщить(ОписаниеОшибки, СтатусСообщения.Важное);
			КонецЕсли;	
			Результат = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//nva +++ 

//контроль остатков по регистру
//параметры:
//Документ - ДокументСсылка - ссылка на документ-регистратор
//СкладРасхода - Справочник.Склады - склад,на котором проверяется остаток
//ТаблицаТовары - ТаблицаЗначений - товары, которые нужно списывать. Колонки:
//										- Номенклатура - Справочник.Номенклатура
//										- Количество - число
//ДатаДвижения - Дата на которую осуществляется движение - если не задана, будет использована дата документа
//
//Возвращает:
//ТаблицаЗначений подготовленная для движений по регистру
Функция ПолучитьОстаткиРезервовПономенклатуре(Знач Документ, Знач Организация, Знач СкладРасхода, Знач ТаблицаТовары, Знач ДатаДвижения = Неопределено, ЭтоРезервирование = Ложь, ВыводОшибкиВРМК = Ложь, ИнформацияОбОшибке = Неопределено) Экспорт
	
	//ОбщиеСклады = Константы.ОбщиеСклады.Получить();
	
	Если (ДатаДвижения = Неопределено) или (ДатаДвижения = Дата(1,1,1)) Тогда
		ДатаДвижения = Документ.Дата;
	КонецЕсли;
	
	ВремТаблицаТовары = Новый ТаблицаЗначений;
	ВремТаблицаТовары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ВремТаблицаТовары.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ВремТаблицаТовары.Колонки.Добавить("СерияНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	ВремТаблицаТовары.Колонки.Добавить("Количество",Новый ОписаниеТипов("число"));
	ВремТаблицаТовары.Колонки.Добавить("Коэффициент",Новый ОписаниеТипов("число"));
	
	//++ №6629 добавился вид документа резерва "Монтаж"
	//ВремТаблицаТовары.Колонки.Добавить("Заказ", Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя")); // №3626
	МассивВидов = новый Массив;
	МассивВидов.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
	МассивВидов.Добавить(Тип("ДокументСсылка.Монтаж"));
	ВремТаблицаТовары.Колонки.Добавить("Заказ", новый ОписаниеТипов(МассивВидов));
	//-- №6629
	
	Для Каждого ТекущаяСтрока Из ТаблицаТовары Цикл
		//++ #12079
		//Если НЕ ТекущаяСтрока.Номенклатура = Справочники.Номенклатура.ОстаткиПленки
		//	И НЕ ТекущаяСтрока.Номенклатура = Справочники.Номенклатура.МатериалЗаказчика Тогда
		Если НЕ ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.ОстатокПленки
			//++ #14311
			//И НЕ ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.МатериалЗаказчика Тогда
			И НЕ ТекущаяСтрока.Номенклатура.МатериалЗаказчика Тогда
			//-- #14311
		//-- #12079
			НоваяСтрока = ВремТаблицаТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЕсли;
	КонецЦикла;
		
	ВремТаблицаТовары.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,СерияНоменклатуры,Коэффициент, Заказ", "Количество");
	
	Запрос = Новый Запрос; 	
	Запрос.УстановитьПараметр("ИспользоватьРезервирование", Константы.ИспользоватьРезервирование.Получить());
	//Запрос.УстановитьПараметр("ТекДата",ДатаДвижения);
	Запрос.УстановитьПараметр("ТекДатаГраница", Новый Граница(ДатаДвижения, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Склад",СкладРасхода);
	Запрос.УстановитьПараметр("ТаблицаТовары",ВремТаблицаТовары); 
	//nva +++
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда       
		Если ТипЗнч(Документ.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			//СписокПодчиненныеДокументы = ОбщийМодульДокументы.ПолучитьПодчиненныеДокументы(Документ.Основание);
			Запрос.УстановитьПараметр("ДокументРезерва", Документ.Основание);  //nva 
		Иначе
			Запрос.УстановитьПараметр("ДокументРезерва", Документы.Резервирование.ПустаяСсылка());
		КонецЕсли;
	Иначе
		Запрос.УстановитьПараметр("ДокументРезерва", Документы.Резервирование.ПустаяСсылка());	
	КонецЕсли;
	//nva ---
	
	ВременныеТаблицы = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = ВременныеТаблицы;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ТаблицаТовары.Количество КАК Количество,
	|	ТаблицаТовары.Коэффициент КАК Коэффициент,
	|	ТаблицаТовары.Заказ КАК Заказ
	|ПОМЕСТИТЬ ВТ_ТаблицаТовары
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ВЫРАЗИТЬ(СУММА(ЕСТЬNULL(ВТ_ТаблицаТовары.Количество * ВТ_ТаблицаТовары.Коэффициент, 0)) КАК ЧИСЛО(15, 2)) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВРезервеОстатки.КоличествоОстаток, 0) > ЕСТЬNULL(ВТ_ТаблицаТовары.Количество * ВТ_ТаблицаТовары.Коэффициент, 0)
	|				ТОГДА ЕСТЬNULL(ВТ_ТаблицаТовары.Количество * ВТ_ТаблицаТовары.Коэффициент, 0)
	|			ИНАЧЕ ЕСТЬNULL(ВРезервеОстатки.КоличествоОстаток, 0)
	|		КОНЕЦ) КАК ВРезервеПодДаннуюСтроку
	|ПОМЕСТИТЬ ТаблицаТовары
	|ИЗ
	|	ВТ_ТаблицаТовары КАК ВТ_ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Организация = &Организация) КАК ВРезервеОстатки
	|		ПО ВТ_ТаблицаТовары.Номенклатура = ВРезервеОстатки.Номенклатура
	|			И ВТ_ТаблицаТовары.ХарактеристикаНоменклатуры = ВРезервеОстатки.ХарактеристикаНоменклатуры
	|			И ВТ_ТаблицаТовары.СерияНоменклатуры = ВРезервеОстатки.СерияНоменклатуры
	|			И (ВРезервеОстатки.ДокументРезерва = &ДокументРезерва)
	|			И (ВРезервеОстатки.Склад = &Склад)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаТовары.Номенклатура,
	|	ВТ_ТаблицаТовары.ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаТовары.СерияНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокСписания.Номенклатура КАК Номенклатура,
	|	ДокСписания.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДокСписания.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ДокСписания.Количество КАК Количество,
	|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА &ИспользоватьРезервирование
	|			ТОГДА ЕСТЬNULL(ВРезервеОстатки.КоличествоОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоВРезерве,
	|	ВЫБОР
	|		КОГДА &ИспользоватьРезервирование
	|			ТОГДА ЕСТЬNULL(ДокСписания.ВРезервеПодДаннуюСтроку, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоВРезервеПодДаннуюСтроку,
	|	ВРезервеОстатки.ДокументРезерва КАК ДокументРезерва
	|ИЗ
	|	ТаблицаТовары КАК ДокСписания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&ТекДатаГраница,
	|				Склад = &Склад
	|					И Организация = &Организация
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							ДокСписания.Номенклатура
	|						ИЗ
	|							ТаблицаТовары КАК ДокСписания)
	|					И ХарактеристикаНоменклатуры В
	|						(ВЫБРАТЬ
	|							ДокСписания.ХарактеристикаНоменклатуры
	|						ИЗ
	|							ТаблицаТовары КАК ДокСписания)
	|					И СерияНоменклатуры В
	|						(ВЫБРАТЬ
	|							ДокСписания.СерияНоменклатуры
	|						ИЗ
	|							ТаблицаТовары КАК ДокСписания)) КАК Остатки
	|		ПО (Остатки.Номенклатура = ДокСписания.Номенклатура)
	|			И (Остатки.ХарактеристикаНоменклатуры = ДокСписания.ХарактеристикаНоменклатуры)
	|			И (Остатки.СерияНоменклатуры = ДокСписания.СерияНоменклатуры)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&ТекДатаГраница, Организация = &Организация) КАК ВРезервеОстатки
	|		ПО ДокСписания.Номенклатура = ВРезервеОстатки.Номенклатура
	|			И ДокСписания.ХарактеристикаНоменклатуры = ВРезервеОстатки.ХарактеристикаНоменклатуры
	|			И ДокСписания.СерияНоменклатуры = ВРезервеОстатки.СерияНоменклатуры
	|			И (ВРезервеОстатки.Склад = &Склад)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ИспользоватьРезервирование
	|				ТОГДА ЕСТЬNULL(ДокСписания.ВРезервеПодДаннуюСтроку, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ > 0";	
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции


//nva ---
